coocox/Mplib/Toshaba/TMPM061/cmsis_lib/lib/src/tmpm061_cg.c
    if (Source == CG_FOSC_OSC1) {
        TSB_CG->OSCCR |= OSCCR_OSCSEL_SET;
    } else {
        TSB_CG->OSCCR &= OSCCR_OSCSEL_CLEAR;
    }
}

/**
  * @brief  Get the source of high-speed oscillator (fosc)
  * @param  None
  * @retval Source of fosc
  *   The value returned can be one of the following values:
  *   CG_FOSC_OSC1 or CG_FOSC_OSC2
  */
CG_FoscSrc CG_GetFoscSrc(void)
{
    uint32_t tmp = TSB_CG->OSCCR;
    CG_FoscSrc fosc_src = CG_FOSC_OSC2;
    tmp &= OSCCR_OSCSEL_SET;

    if (tmp != 0U) {
        fosc_src = CG_FOSC_OSC1;
    } else {
        /* Do nothing */
    }

    return fosc_src;
}

/**
  * @brief  Get the state of high-speed oscillator (fosc)
  * @param  Source: Select fosc source
  *   This parameter can be one of the following values:
  *   CG_FOSC_OSC1 or CG_FOSC_OSC2
  * @retval State of fosc
  *   The value returned can be one of the following values:
  *   ENABLE or DISABLE
  */
FunctionalState CG_GetFoscState(CG_FoscSrc Source)
{
    FunctionalState state = DISABLE;
    uint32_t tmp1 = TSB_CG->OSCCR;
	uint32_t tmp2 = TSB_CG->OSCCR;

    tmp1 &= OSCCR_XEN1_CLEAR;
   
    tmp2 &= OSCCR_XEN2_CLEAR;    
    /* Check the parameters */
    assert_param(IS_CG_FOSC_SRC(Source));

    if (Source == CG_FOSC_OSC1) {
        if (tmp1 != 0U) {
            state = ENABLE;
        } else {
            /* Do nothing */
        }
    } else {
        if (tmp2 != 0U) {
            state = ENABLE;
        } else {
            /* Do nothing */
        }
    }

    return state;
}

/**
  * @brief  Enable or disable low-speed oscillator (fs)
  * @param  NewState: oscillator is enabled or disabled
  *   This parameter can be one of the following values:
  *   DISABLE or ENABLE
  * @retval Success or failure
  *   The value returned can be one of the following values:
  *   SUCCESS or ERROR
  */
Result CG_SetFs(FunctionalState NewState)
{
    CG_FsysSrc fsys_src = CG_FSYS_SRC_FGEAR;
    Result retval = ERROR;

    /* Check the parameters */
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    if (NewState == ENABLE) {
        /* Enable low-speed oscillator */
        TSB_CG->OSCCR |= OSCCR_XTEN_SET;
        retval = SUCCESS;
    } else {
        fsys_src = CG_GetFsysSrc();
        if (fsys_src == CG_FSYS_SRC_FS) {
            /* fs is in  use. so it can't be disabled */
            retval = ERROR;
        } else {
            /* Disable low-speed oscillator */
            TSB_CG->OSCCR &= OSCCR_XTEN_CLEAR;
            retval = SUCCESS;
        }
    }

    return retval;
}

/**
  * @brief  Get the state of low-speed oscillator (fs)
  * @param  None
  * @retval State of fs
  *   The value returned can be one of the following values:
  *   DISABLE or ENABLE
  */
FunctionalState CG_GetFsState(void)
{
    FunctionalState state = DISABLE;
    uint32_t tmp = TSB_CG->OSCCR;
    tmp &= OSCCR_XTEN_SET;
    
    if (tmp != 0U) {
        state = ENABLE;
    } else {
        /* Do nothing */
    }

    return state;
}

/**
  * @brief  Set portM for X1/X2 or general port
  * @param New mode of portM.
  *   This parameter can be one of the following values:
  *   CG_PORTM_AS_GPIO or CG_PORTM_AS_HOSC
  * @retval None
  */
void CG_SetPortM(CG_PortMMode Mode)
{
    /* Check the parameters */
    assert_param(IS_CG_PROTM_FUNCTION(Mode));

    if (Mode == CG_PORTM_AS_HOSC) {
        TSB_CG->OSCCR |= OSCCR_HOSCON_SET;
    } else {
        TSB_CG->OSCCR &= OSCCR_HOSCON_CLEAR;
    }
}

/**
  * @brief  Select the Low-speed clock.
  * @param  Source £ºLow-speed clock
  *   This parameter can be one of the following values:
  *   CG_LOSC_OSC or CG_LOSC_CLK.
  * @retval None
  */
void CG_SetLowOscSrc(CG_LoscSrc Source)
{
    /* Check the parameters */
    assert_param(IS_CG_LOSC_FUNCTION(Source));

    if (Source == CG_LOSC_CLK) {
        TSB_CG->OSCCR |= OSCCR_LOSCSEL_SET;
    } else {
        TSB_CG->OSCCR &= OSCCR_LOSCSEL_CLEAR;
    }
}

/**
  * @brief  enable or disable external high-speed clock input.
  * @param  NewState: Enable or disable
  *   This parameter can be one of the following values:
  *   DISABLE or ENABLE
  * @retval None
  */
void CG_SetExtHighClk(FunctionalState NewState)
{
    /* Check the parameters */
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    if (NewState == ENABLE) {
        TSB_CG->OSCCR |= OSCCR_EHCLKEN_SET;
    } else {
        TSB_CG->OSCCR &= OSCCR_EHCLKEN_CLEAR;
    }
}

/**
  * @brief  Set to the specified low-power mode
  * @param  Low power mode
  *   The value can be one of the following values:
  *   CG_STBY_MODE_STOP, CG_STBY_MODE_SLEEP, CG_STBY_MODE_IDLE
  * @retval None
  */
void CG_SetSTBYMode(CG_STBYMode Mode)
{
    uint32_t regval = TSB_CG->STBYCR;

    /* Check the parameter */
    assert_param(IS_CG_STBY_MODE(Mode));

    regval &= CG_STBY_MODE_MASK;
    regval |= (uint32_t)Mode;

    TSB_CG->STBYCR = regval;
}

/**
  * @brief  Get the low-power consumption mode
  * @param  None
  * @retval Low power mode
  *   The value returned can be one of the following values:
  *   CG_STBY_MODE_STOP, CG_STBY_MODE_SLEEP, CG_STBY_MODE_IDLE or CG_STBY_MODE_UNKNOWN
  */
CG_STBYMode CG_GetSTBYMode(void)
{
    CG_STBYMode stby_mode = CG_STBY_MODE_UNKNOWN;
    uint8_t regval = (uint8_t) (TSB_CG->STBYCR & (~CG_STBY_MODE_MASK));

    stby_mode = numToSTBYMode_table[regval];

    return stby_mode;
}

/**
  * @brief  Enables or disables fosc after releasing stop mode
  * @param  NewState: Enable or disable
  *   This parameter can be one of the following values:
  *   DISABLE or ENABLE
  * @retval None
  */
void CG_SetExitStopModeFosc(FunctionalState NewState)
{
    /* Check the parameters */
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    if (NewState == ENABLE) {
        TSB_CG->STBYCR |= STBYCR_RXEN_SET;
    } else {
        TSB_CG->STBYCR &= STBYCR_RXEN_CLEAR;
    }
}

/**
  * @brief  Get the state of fosc after releasing stop mode.
  * @param  None
  * @retval State of fosc after releasing stop mode
  *   This parameter can be one of the following values:
  *   DISABLE or ENABLE
  */
FunctionalState CG_GetExitStopModeFoscState(void)
{
    uint32_t tmp = TSB_CG->STBYCR;
	FunctionalState state = DISABLE;

    tmp &= STBYCR_RXEN_SET;

    if (tmp != 0U) {
        state = ENABLE;
    } else {
        /* Do nothing */
    }

    return state;
}

/**
  * @brief  Enables or disables fs after releasing stop mode
  * @param  NewState: enable or disable
  *   This parameter can be one of the following values:
  *   DISABLE or ENABLE
  * @retval None
  */
void CG_SetExitStopModeFs(FunctionalState NewState)
{
    /* Check the parameters */
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    if (NewState == ENABLE) {
        TSB_CG->STBYCR |= STBYCR_RXTEN_SET;
    } else {
        TSB_CG->STBYCR &= STBYCR_RXTEN_CLEAR;
    }
}

/**
  * @brief  Get the state of fs after releasing stop mode.
  * @param  None
  * @retval State of fs after releasing stop mode
  *   This parameter can be one of the following values:
  *   DISABLE or ENABLE
  */
FunctionalState CG_GetExitStopModeFsState(void)
{
	FunctionalState state = DISABLE;
    uint32_t tmp = TSB_CG->STBYCR;
    tmp &= STBYCR_RXTEN_SET;

    if (tmp != 0U) {
        state = ENABLE;
    } else {
        /* Do nothing */
    }

    return state;
}

/**
  * @brief  Set pin status in stop mode
  * @param  NewState: enable or disable
  *   This parameter can be one of the following values:
  *   ENABLE or DISABLE
  * @retval None
  */
void CG_SetPinStateInStopMode(FunctionalState NewState)
{
    /* Check the parameters */
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    if (NewState == ENABLE) {
        TSB_CG->STBYCR |= STBYCR_DRVE_SET;
    } else {
        TSB_CG->STBYCR &= STBYCR_DRVE_CLEAR;
    }
}

/**
  * @brief  Get pin status in stop mode
  * @param  None
  * @retval State of pin in stop mode
  *   The value returned can be one of the following values:
  *   DISABLE or ENABLE
  */
FunctionalState CG_GetPinStateInStopMode(void)
{
	FunctionalState state = DISABLE;
    uint32_t tmp = TSB_CG->STBYCR;
    tmp &= STBYCR_DRVE_SET;

    if (tmp != 0U) {
        /* Pin status in stop mode is active */
        state = ENABLE;
    } else {
        /* Do nothing */
    }

    return state;
}

/**
  * @brief  Use the clock selected by CGOSCCR<OSCSEL> or Use the external high-speed clock input
  * @param  Source: Select the source clock
  *   This parameter can be one of the following values:
  *   CG_EHCLK_OSCSEL or CG_EHCLK_OSC2
  * @retval None
  */
void CG_SelExtHighClk (CG_EHClkSrc Source)
{
    /* Check the parameters */
    assert_param(IS_CG_EHCLK_FUNCTION(Source));

