coocox/Mplib/Toshaba/TMPM061/cmsis_lib/lib/src/tmpm061_cg.c
    if (Source == CG_EHCLK_OSC2) {
        TSB_CG->EHCLKSEL |= EHCLKSEL_EHCLKSEL_SET;
    } else {
        TSB_CG->EHCLKSEL &= EHCLKSEL_EHCLKSEL_CLEAR;
    }
}

/**
  * @brief  Set the source of fsys
  * @param  Source: Select the source of fsys
  *   This parameter can be one of the following values:
  *   CG_FSYS_SRC_FGEAR or CG_FSYS_SRC_FS
  * @retval Success or failure
  *   The value returned can be one of the following values:
  *   SUCCESS or ERROR
  */
Result CG_SetFsysSrc(CG_FsysSrc Source)
{
    Result retval = ERROR;
    FunctionalState fosc_on = DISABLE;
    FunctionalState fs_on = DISABLE;
    CG_FoscSrc fosc_src = CG_FOSC_OSC1;
    CG_FsysSrc fsyssrc = CG_FSYS_SRC_FGEAR;

    /* Check the parameters */
    assert_param(IS_CG_FSYS_SRC(Source));

    if (Source == CG_FSYS_SRC_FGEAR) {
        fosc_src = CG_GetFoscSrc();
        if (fosc_src == CG_FOSC_OSC1) {
            fosc_on = CG_GetFoscState(CG_FOSC_OSC1);
            if (fosc_on == ENABLE) {
                /* Set sysclk to fgear */
                TSB_CG->CKSEL &= CKSEL_SYSCK_CLEAR;

                do {
                    fsyssrc = CG_GetFsysSrc();
                } while (fsyssrc != CG_FSYS_SRC_FGEAR);
                retval = SUCCESS;
            } else {
                /* Do nothing */
            }
        } else {
            fosc_on = CG_GetFoscState(CG_FOSC_OSC2);
            if (fosc_on == ENABLE) {
                /* Set sysclk to fgear */
                TSB_CG->CKSEL &= CKSEL_SYSCK_CLEAR;

                do {
                    fsyssrc = CG_GetFsysSrc();
                } while (fsyssrc != CG_FSYS_SRC_FGEAR);
                retval = SUCCESS;
            } else {
                /* Do nothing */
            }
        }
    } else {
        fs_on = CG_GetFsState();
        if (fs_on == ENABLE) {
            /* Set sysclk to fs */
            TSB_CG->CKSEL |= CKSEL_SYSCK_SET;
            do {
                fsyssrc = CG_GetFsysSrc();
            } while (fsyssrc != CG_FSYS_SRC_FS);
            retval = SUCCESS;
        } else {
            /* Do nothing */
        }
    }

    return retval;
}

/**
  * @brief  Get the clock source of fsys
  * @param  None
  * @retval Source of fsys
  *   The value returned can be one of the following values:
  *   CG_FSYS_SRC_FGEAR or CG_FSYS_SRC_FS
  */
CG_FsysSrc CG_GetFsysSrc(void)
{
    CG_FsysSrc fsyssrc = CG_FSYS_SRC_FGEAR;
    uint32_t tmp = TSB_CG->CKSEL;
    tmp &= CKSEL_SYSCKFLG_SET;
    
    if (tmp == 1U) {
        fsyssrc = CG_FSYS_SRC_FS;
    } else {
        /* Do nothing */
    }

    return fsyssrc;
}

/**
  * @brief  Setup the INT source for releasing low power mode.
  * @param  INTSource: Select the release INT source
  *   This parameter can be one of the following values:
  *   CG_INT_SRC_INTLVD, CG_INT_SRC_0, CG_INT_SRC_1, CG_INT_SRC_2,     
  *   CG_INT_SRC_3, CG_INT_SRC_RTC
  * @param  ActiveState: Select the active state for release trigger
  *   For INTRTC, only "FALLING" state can be set, no matter what the value of ActiveState is.
  *   For INTLVD, only "RISING" state can be set, no matter what the value of ActiveState is.
  *   Others  parameter can be one of the following values:
  *   CG_INT_ACTIVE_STATE_L, CG_INT_ACTIVE_STATE_H, CG_INT_ACTIVE_STATE_FALLING,
  *   CG_INT_ACTIVE_STATE_RISING or CG_INT_ACTIVE_STATE_BOTH_EDGES
  * @param  NewState: Enable or disable this release trigger
  *   This parameter can be one of the following values:
  *   DISABLE or ENABLE
  * @retval None
  */
void CG_SetSTBYReleaseINTSrc(CG_INTSrc INTSource,
                             CG_INTActiveState ActiveState, FunctionalState NewState)
{
    uint32_t num = 0U;
    uint8_t i = 0U;
    uint8_t j = 0U;
    CG_Byte4 regval[3] = { {0U}
    , {0U}
    , {0U}
    };

    /* Check the parameters */
    assert_param(IS_CG_INT_SRC(INTSource));
    assert_param(IS_CG_INT_ACTIVE_STATE(ActiveState));
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    num = (uint32_t) INTSource;
    i = (uint8_t) (num / 4U);
    j = (uint8_t) (num % 4U);

    switch (i) {
    case 0U:                   /* IMCGA */
        regval[0].byte4 = TSB_CG->IMCGA;
        regval[0].byte[j] &= 0x8eU;
        if(INTSource == CG_INT_SRC_INTLVD) {
          ActiveState = CG_INT_ACTIVE_STATE_RISING;
        }
        regval[0].byte[j] |= ActiveState;
        TSB_CG->IMCGA = regval[0].byte4;
        regval[0].byte[j] |= NewState;
        TSB_CG->IMCGA = regval[0].byte4;
        break;

    case 1U:                   /* IMCGB */
        regval[1].byte4 = TSB_CG->IMCGB;
        regval[1].byte[j] &= 0x8eU;
        if (INTSource == CG_INT_SRC_RTC) {
            ActiveState = CG_INT_ACTIVE_STATE_FALLING;
        }
        regval[1].byte[j] |= ActiveState;
        TSB_CG->IMCGB = regval[1].byte4;
        regval[1].byte[j] |= NewState;
        TSB_CG->IMCGB = regval[1].byte4;
        break;
    default:
        /* Do nothing */
        break;
    }
}

/**
  * @brief  Gets the active state of INT source standby clear request
  * @param  INTSource: Select the release INT source
  *   This parameter can be one of the following values:
  *   CG_INT_SRC_INTLVD, CG_INT_SRC_0, CG_INT_SRC_1, CG_INT_SRC_2,     
  *   CG_INT_SRC_3, CG_INT_SRC_RTC
  * @retval Active state of the input INT
  *   The value returned can be one of the following values:
  *   CG_INT_ACTIVE_STATE_FALLING, CG_INT_ACTIVE_STATE_RISING,
  *   CG_INT_ACTIVE_STATE_BOTH_EDGES or CG_INT_ACTIVE_STATE_INVALID
  */
CG_INTActiveState CG_GetSTBYReleaseINTState(CG_INTSrc INTSource)
{
    CG_INTActiveState int_active_state = CG_INT_ACTIVE_STATE_INVALID;
    uint8_t i = 0U;
    uint8_t j = 0U;
    uint8_t tmp = 0U;
    uint32_t num = 0U;
    CG_Byte4 regval[2] = { {0U}
    , {0U}
    };

    /* Check the parameters */
    assert_param(IS_CG_INT_SRC(INTSource));

    regval[0].byte4 = TSB_CG->IMCGA;
    regval[1].byte4 = TSB_CG->IMCGB;

    num = (uint32_t) INTSource;
    i = (uint8_t) (num / 4U);
    j = (uint8_t) (num % 4U);
    tmp = regval[i].byte[j];
    tmp &= 0x0CU;

    switch (tmp) {
    case 0x04U:
        int_active_state = CG_INT_ACTIVE_STATE_RISING;
        break;
    case 0x08U:
        int_active_state = CG_INT_ACTIVE_STATE_FALLING;
        break;
    case 0x0CU:
        int_active_state = CG_INT_ACTIVE_STATE_BOTH_EDGES;
        break;
    default:
        /* Do nothing */
        break;
    }

    return (int_active_state);
}

/**
  * @brief  Clears the input INT request.
  * @param  INTSource: Select the release INT source
  *   This parameter can be one of the following values:
  *   CG_INT_SRC_INTLVD, CG_INT_SRC_0, CG_INT_SRC_1, CG_INT_SRC_2,     
  *   CG_INT_SRC_3,CG_INT_SRC_RTC
  * @retval None
  */
void CG_ClearINTReq(CG_INTSrc INTSource)
{
    uint32_t regval = INTSource;

    /* Check the parameters */
    assert_param(IS_CG_INT_SRC(INTSource));

    TSB_CG->ICRCG = regval;
}

/**
  * @brief  Get the type of reset reason and clear the reset flag.
  * @param  None
  * @retval Reset flag
  */
CG_ResetFlag CG_GetResetFlag(void)
{
    CG_ResetFlag reset_flag = { 0U };

    reset_flag.All = TSB_CG->RSTFLG & (~CG_RESET_FLAG_MASK);
    TSB_CG->RSTFLG = 0U;

    return reset_flag;
}

/** @} */
/* End of group CG_Exported_Functions */

/** @} */
/* End of group CG */

/** @} */
/* End of group TX00_Periph_Driver */
#endif                          /* defined(__TMPM061_CG_H)  */
